xmlcf/DataProcessors/ЗагрузкаДвиженийТинькофф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДвиженийТинькофф</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗагрузкиТинькофф</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

xmlcf/Enums/ВидЗагрузкиТинькофф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидЗагрузкиТинькофф</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СовершенныеСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацииСДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xmlcf/Documents/ПриобретениеАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриобретениеАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.АктивыОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссииУстановленаВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlcf/Documents/ПродажаАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПродажаАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.АктивыОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссииУстановленаВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlcf/Documents/ПриобретениеВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриобретениеВалюты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриобретения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриобретения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссииУстановленаВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlcf/Catalogs/Активы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Активы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидАктива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Comment>Для облигаций</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Биржа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйАктив</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидБазовгоАктива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаБезРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаНавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>figi</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИндивидуальныеКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Брокер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Брокер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xmlcf/DataProcessors/ЗагрузкаДвиженийТинькофф/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПрочитатьТабличныйДокумент(Команда)
	
	ПрочитатьТабличныйДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьТабличныйДокументНаКлиенте()
	
	#Если ТолстыйКлиентУправляемоеПриложение тогда
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область());
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Выполнить();
	
	ТаблицаВыгрузки = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого КолонкаТаблицы из ТаблицаВыгрузки.Колонки цикл
		Если СтрНайти(КолонкаТаблицы.Имя,"_") > 0 тогда
			НовоеИмяКолонки = СтрЗаменить(КолонкаТаблицы.Имя,"_",""); 
			ТаблицаВыгрузки.Колонки[КолонкаТаблицы.Имя].Имя = НовоеИмяКолонки;			
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаСовершенныхСделок.Очистить();
	
	Если Объект.ВидЗагрузки = Перечисления.ВидЗагрузкиТинькофф.СовершенныеСделки тогда
		
		Для каждого СтрокаТаблицы из ТаблицаВыгрузки цикл
			НоваяСтрока = ТаблицаСовершенныхСделок.Добавить();			
			НоваяСтрока.НомерСделки 			= СтрокаТаблицы.НомерСделки;	
			НоваяСтрока.НомерПоручения 			= СтрокаТаблицы.НомерПоручения;
			НоваяСтрока.ДатаВремяСделки 		= ПолучитьДатуВремя(СтрокаТаблицы.ДатаЗаключения, СтрокаТаблицы.Время);
			НоваяСтрока.ВидСделки 				= СтрокаТаблицы.ВидСделки;
			НоваяСтрока.СокращенноеНаименованиеАктива = СтрокаТаблицы.СокращенноеНаименованиеАктива;
			НоваяСтрока.ТикерАктива 			= СтрокаТаблицы.КодАктива;
			НоваяСтрока.ЦенаЗаЕдиницу 			= СтрокаТаблицы.ЦенаЗаЕдиницу;
			НоваяСтрока.Валюта					= НайтиВалюту(СтрокаТаблицы.ВалютаРасчетов);
			НоваяСтрока.Количество 				= СтрокаТаблицы.Количество;
			НоваяСтрока.СуммаБезНКД 			= СтрокаТаблицы.СуммаБезНКД;
			НоваяСтрока.НКД 					= СтрокаТаблицы.НКД;
			НоваяСтрока.КомиссияБрокера 		= СтрокаТаблицы.КомиссияБрокера;
			НоваяСтрока.ДокументСделки 			= НайтиДокументСделки(НоваяСтрока.НомерСделки,НоваяСтрока.НомерПоручения, НоваяСтрока.ДатаВремяСделки);
			НоваяСтрока.Актив 					= НайтиАктив(НоваяСтрока.ТикерАктива);
		КонецЦикла;
		
	ИначеЕсли Объект.ВидЗагрузки = Перечисления.ВидЗагрузкиТинькофф.ОперацииСДС тогда
		
		
	КонецЕсли;
	
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДатуВремя(ДатаСтр,ВремяСтр)
	
	Возврат Дата(ДатаСтр + " " + ВремяСтр);
	
КонецФункции

&НаСервере
Функция НайтиВалюту(ВалютаСтр)
	
	Возврат Справочники.Валюта.НайтиПоНаименованию(ВалютаСтр);
	
КонецФункции

&НаСервере
Функция НайтиДокументСделки(НомерСделки,НомерПоручения,ДатаВремяСделки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеАктива.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриобретениеАктива КАК ПриобретениеАктива
		|ГДЕ
		|	ПриобретениеАктива.НомерСделки = &НомерСделки
		|	И ПриобретениеАктива.НомерПоручения = &НомерПоручения
		|	И ПриобретениеАктива.Дата = &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажаАктива.Ссылка
		|ИЗ
		|	Документ.ПродажаАктива КАК ПродажаАктива
		|ГДЕ
		|	ПродажаАктива.НомерСделки = &НомерСделки
		|	И ПродажаАктива.НомерПоручения = &НомерПоручения
		|	И ПродажаАктива.Дата = &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеВалюты.Ссылка
		|ИЗ
		|	Документ.ПриобретениеВалюты КАК ПриобретениеВалюты
		|ГДЕ
		|	ПриобретениеВалюты.НомерСделки = &НомерСделки
		|	И ПриобретениеВалюты.НомерПоручения = &НомерПоручения
		|	И ПриобретениеВалюты.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", 			ДатаВремяСделки);
	Запрос.УстановитьПараметр("НомерПоручения", НомерПоручения);
	Запрос.УстановитьПараметр("НомерСделки", 	НомерСделки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
			
КонецФункции

&НаСервере
Функция НайтиАктив(ТикерСтр)
	
	Возврат Справочники.Активы.НайтиПоРеквизиту("Тикер",ТикерСтр);
	
КонецФункции

&НаСервере
Процедура СоздатьАктивыНаСервере()

	Для каждого СтрокаТаблицы из ТаблицаСовершенныхСделок цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Актив) тогда	
			//НовыйАктив = Справочники.Активы.СоздатьЭлемент();
			//НовыйАктив.
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАктивы(Команда)
	СоздатьАктивыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Для каждого СтрокаТаблицы из ТаблицаСовершенныхСделок цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументСделки) тогда
			Если СтрокаТаблицы.ВидСделки = "Покупка" тогда
				НовыйДокумент = Документы.ПриобретениеАктива.СоздатьДокумент();
				НовыйДокумент.Актив = СтрокаТаблицы.Актив;
				НовыйДокумент.Дата = СтрокаТаблицы.ДатаВремяСделки;
				НовыйДокумент.Количество = СтрокаТаблицы.Количество;
				НовыйДокумент.НКД = СтрокаТаблицы.НКД;
				НовыйДокумент.НомерПоручения = СтрокаТаблицы.НомерПоручения;
				НовыйДокумент.НомерСделки = СтрокаТаблицы.НомерСделки;
				НовыйДокумент.Портфель = Объект.Портфель;
				НовыйДокумент.Сумма = СтрокаТаблицы.СуммаБезНКД;
				НовыйДокумент.СуммаКомиссии = СтрокаТаблицы.КомиссияБрокера;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);			
			ИначеЕсли СтрокаТаблицы.ВидСделки = "Продажа" тогда
			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	Токен = ИнтеграцияСТинькоффПоAPIСервер.ТокенПоПортфелю(Объект.Портфель);
	ИнтеграцияСТинькоффПоAPIСервер.ПолучитьТаблицуОперацийПоПортфелю(Токен,НачалоГода(ТекущаяДата()),ТекущаяДата());
	
КонецПроцедуры
